[{"id": "83b778e8-4534-49a4-9ee2-50600356f963", "created_at": "2024-04-11T10:50:23.115873Z", "updated_at": "2024-04-15T21:13:17.921050Z", "content": "I think I want all tags to be lower case, i can enforce that. Also, this text entry is behaving a little weirdly. Whenever I type a space or a new line, it resets the cursor to right after the last character. Something bug with the way state is updated probably. Oh I've added all these entries to the wrong day. I must block entry of new ideas or editing of text on other days. Also, sending report functionality is not working. I need to fix these things for it to be useful to me. I'm loving the background though. Also the cursor still shows even when this text entry has been deactivated, needs the user-select setting.", "mood": 3, "actions": "", "entry": "0d0e4f26-2296-45fa-ac58-eab21ffd423f", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "1e459a62-f9d2-416d-b7eb-e54fd24e35f0", "created_at": "2024-06-03T18:23:18.662714Z", "updated_at": "2024-06-03T18:26:32.489315Z", "content": "Had a call with Lana from Amazon today, she gave me a run through of the interview process. I then had a call with Paul Dingle from Amazon for a culture chat, he was older than I expected which was actually quite refreshing, and he was very honest and candid about life at Amazon. I feel like I have a better understanding of the company. I am dreading the interview on Thursday, not because I'm nervous, but because I'm quite exhausted and it's a lot of effort, but I'll do it anyway. Partly because I'll damage a relationship with Massimo if I drop out, and partly because it'll be good for me to experience and keep me on my toes. Who knows, I might even do well. They're telling me to prepare lots for the leadership principles, which I am. A note about my approach, I've learned from the Monzo experience, I'm not going hell bent on improving, learning, reading etc. I'm saying to myself, everything that will come up in the interview, I already know. It's a matter of maintaining everything in the status quo and just making sure I'm feeling energised on the day. To that end, I'm feeling positive and almost excited about it. Of course I'm only having this attitude because I don't intend to accept the offer. Still, it'll be good to know I can get it, it's 130K salary after all.", "mood": 4, "actions": "Prepare for the Amazon interview focusing on the leadership principles;Maintain a positive and energized mindset for the interview;Decide on a strategy to handle the job offer if it comes", "entry": "22916b96-3236-4dc0-b19e-bf0a8325402e", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "5c3c2bab-e074-489d-a2a8-85046f68fd00", "created_at": "2024-04-10T21:30:52.532154Z", "updated_at": "2024-04-15T21:13:34.498233Z", "content": "Right, this is my first official entry in Continuum. I'm dogfooding this platform to make it better.", "mood": 3, "actions": "", "entry": "0d0e4f26-2296-45fa-ac58-eab21ffd423f", "tags": []}, {"id": "3ab97c6b-c00b-4abe-8435-0d0a133ee62c", "created_at": "2024-05-07T13:04:02.888267Z", "updated_at": "2024-05-07T13:05:26.528981Z", "content": "There's been a ticket hanging around forever in the blocked column on Jira about updating the integration test for work for the sim. I have taken my known working configuration that I tried last week that launched a successful sim -> abc -> train. I updated the integration test configuration with it and have raised an MR. At the moment it is crashing because the sim_launcher works with the production endpoint of the sim only, which is not yet working. So I'm blocked on this one for the moment.", "mood": null, "actions": "Update the integration test for work for the sim", "entry": "9bd4a584-dbbd-4e2e-8f55-cad055c39dbd", "tags": ["182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "b4da7e12-0a04-41b5-b3eb-a99cf6187bc8", "created_at": "2024-04-14T10:18:15.340824Z", "updated_at": "2024-04-15T21:12:33.355487Z", "content": "Quick thoughts I'm jotting down whilst using this.\r\n\r\n - The blank screen to the right when no thoughts have yet been created, it looks weird. Maybe something in the middle that says \"Add first thought\".\r\n - The backgrounds are slow to load, I need to minimise them further.\r\n - A hotkey 'Ctrl + N' for adding a thought would be really nice. Also up and down arrows to move through thoughts and 'Enter' to reopen them would be nice. Enter to close as well, then Shift Enter to add multiple lines.", "mood": 3, "actions": "Adjust the blank screen to the right;Minimise the sizes of the backgrounds for fasting loading;Add hotkeys to move between thoughts.", "entry": "4927e422-125b-4f33-9cb8-af8cd1c2d1d2", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "5bdafd8e-98e6-428c-986d-cb975f0e978d", "created_at": "2024-04-12T10:40:55.125874Z", "updated_at": "2024-04-15T21:13:53.798061Z", "content": "So I discovered that Mistral AI are hiring for BE and Fullstack developers with experience in... Django, React, Python, TypeScript. Jackpot. They are like a mini OpenAI. I would love to work for them. I have applied to both roles, and have made a good case for myself. \r\n\r\nIn the meantime, I am going to start relentlessly understanding and contributing to their opensource, to start with their cookbook repo. There is a contributor called SophiaMYang who I found out is head of developer relations. She has been merging PRs as of yesterday, so if I can get some good and impressive examples in over the weekend, then maybe I'm in with a shot.", "mood": 4, "actions": "Contribute to Mistral Opensource.", "entry": "5d9ea949-da44-49ca-a737-c3f616411ba2", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "34adf935-b31a-4bb7-8d8d-328fe0a5e3f1", "created_at": "2024-05-10T08:59:56.918145Z", "updated_at": "2024-05-10T09:28:21.911335Z", "content": "I've been working on building features for Ben that he will definitely find useful. This morning I spent a few hours rewriting the diff tool to make it more stable. It is much better. Probably still not perfect, but it's got it's own page now, and a nice dialog that shows the progress of loading each task. It also runs a bit more slowly to prevent hammering the ClearML API. I've tried a few tests and it seems okay, I've shipped it to Ben, but I do need to come back and add a few tests to it. Although in the process, I have actually broken the ConfigVisualiser, so I need to fix that.", "mood": 4, "actions": "Add tests to the rewritten diff tool;Fix the broken ConfigVisualiser", "entry": "731f2f59-bfab-48ee-bbb9-c0c742f84bbc", "tags": ["182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "554bc7b1-a944-4f91-871b-6e78d857003f", "created_at": "2024-04-15T21:09:17.359063Z", "updated_at": "2024-04-15T21:21:43.635240Z", "content": "So, I have added a new feature, actually I've overhauled how the AI works, there is now an Analysis page which I think is much more useful than an email sent every week. \n\nActually I'm very pleased with progress today, I've made proper headway on Continuum, it's now in a semi impressive state I would say. However I do need to improve the LLM prompt so that I can extract better actions and moods.", "mood": 4, "actions": "Improve the LLM prompt to extract better actions and moods", "entry": "a993a0f2-0bcb-4425-af2d-c72dc18d56e9", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "801a1a6e-2287-4fcb-beed-4425bff47f3d", "created_at": "2024-04-14T10:20:44.662919Z", "updated_at": "2024-04-14T10:22:16.683935Z", "content": "So I had another idea for a side hustle. Capitalise on the work I'm doing on Continuum and produce a udemy course for how to build an AI powered notebook. Idea taken from that guy who is killing two birds with one stone, building an App and building a course for how to build that app. However, I must must must must must validate this idea first before building it.", "mood": null, "actions": "", "entry": "4927e422-125b-4f33-9cb8-af8cd1c2d1d2", "tags": ["3dcbd720-f99e-4d3d-9361-c7af95a3c7a4"]}, {"id": "c291d903-d469-4202-9447-cc17fe3f0f42", "created_at": "2024-04-11T20:23:01.373804Z", "updated_at": "2024-04-15T21:11:13.311013Z", "content": "I've spent the evening redoing my personal website (again). But this time I've narrowed the focus, it's more of an online CV now, a portfolio that offers just a bit more detail than my actual CV. This actually makes more sense I think, I am not a content creator, nor do I want to be. I do have SOME online writing, like my object detection series, but my side hustle is.. this app actually, Continuum. I cannot run an online content creation website as a side hustle to my side hustle. So the online site is designed to be minimal maintenance, mostly a portfolio of stuff I've done. I'll double down on quality I think.", "mood": 4, "actions": "", "entry": "6d756a0a-0015-48bd-8553-63e273028ace", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "b5d8168a-4230-49d1-8a54-7717d9d42eb1", "created_at": "2024-04-11T16:39:26.547697Z", "updated_at": "2024-04-15T21:11:52.440537Z", "content": "Damn it. The MLE 2 job that massimo pointed me at (that I applied to yesterday) was literally filled this morning Massimo told me. So thats gone. There is one other SDE 2 role at Amazon that looks good still so he has referred me for that and I have applied. This is tough, I remember telling arnaud that you have to get excited about it until it doesn't work out, then swiftly move onto the next one. Eitherway I also applied to Monzo BE this morning, I think my application for that one is good, and also their application portal asked for some project experience etc that reminds me of when I applied to RR. I wrote some good stuff there so hopefully they will read that and I'll have a good application. I also applied to Claypot then found out that it has been acquired. This whole experience is an exercise in resilience to be honest.\r\n\r\nSo talking of resilience, another huge opportunity has come up. Microsoft is investing in a new AI Hub in London Paddington, announced just the other day. I need to be so hot on watching for jobs and getting a referral through Neela.", "mood": 4, "actions": "Keep an eye on the Microsoft jobs board.", "entry": "6d756a0a-0015-48bd-8553-63e273028ace", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "b8026c31-2628-449f-b81c-53044d24c05d", "created_at": "2024-04-15T21:22:52.401149Z", "updated_at": "2024-04-15T21:23:46.910685Z", "content": "I GOT A FIRST INTERVIEW WITH MONZO. So freaking happy. I am going all out to prepare for it. I'm getting this Continuum app right up to scratch so I have something to talk about. I'm reviewing how to use Go, and I'm reading various System Design books.", "mood": null, "actions": "Prepare for first interview with Monzo;Review how to use Go language;Read various System Design books", "entry": "a993a0f2-0bcb-4425-af2d-c72dc18d56e9", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "a5d17473-e987-4bdd-a2d5-792d87b88176", "created_at": "2024-04-16T13:39:08.236576Z", "updated_at": "2024-04-16T13:40:16.824374Z", "content": "I'm in a bit of a bad mood today, not entirely sure why. Probably just a bit stressed about everything that's going on right now. I feel like I'm always busy, I think I've been busy recently because of the OMSCS which is now finished, thank god, but I do seem to have just replaced it with job search. And given that I have a monzo application open I am preparing like mad for that because I desperately want to get out of Ultraleap...", "mood": 2, "actions": "Take a break and relax a bit;Organize job search priorities;Prepare thoroughly for Monzo application", "entry": "7becf158-8b83-4a6f-8245-89fe7b9f6ad6", "tags": ["a469ba00-f085-41ed-8085-b10ca59531b7"]}, {"id": "b387d179-3087-40a6-9b43-430ff21d1668", "created_at": "2024-04-25T10:28:03.891184Z", "updated_at": "2024-04-25T20:58:24.991716Z", "content": "Just had my Monzo interview, I completely messed it up, I'm so annoyed with myself. I went with my gut instinct and did a Vaarst system design question because I thought it was cooler to talk about, but I hadn't prepared it, I didn't answer the trade off questions clearly. All my prep I had done went out the window. I'm feeling pretty low at the moment, and I'm pretty sure I'm going to get a rejection, which is a real shame because this was a high stakes job for me. But.. whatever. Keep calm and carry on. I feel really depressed about it right now though. I need to build some resilience. I suppose the only saving grace is that I remember completely messing up my Rolls-Royce interview as well, I even called my parents on the way home to tell them I was already planning what other jobs to look for, then I got the offer. So there is always hope, and we shall see. But regardless of what happens, this changes nothing, my system continues.", "mood": 1, "actions": "", "entry": "e352cffe-7782-4b7d-9c92-bdec5499263e", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "7d55e632-595c-463c-af6d-4c08b6dc0e17", "created_at": "2024-04-25T11:05:38.468384Z", "updated_at": "2024-04-25T11:06:53.788820Z", "content": "Some thoughts on the Monzo interview. I need to learn to be concise, I was going overtime in lots of my answers and the interviewer kept cutting me off. I need a self contained project I can talk about that is simple to communicate that offers lots of hooks into interesting questions so that I can have interesting and good answers lined up. Also priming the interview to ask those questions.", "mood": 3, "actions": "Learn to be more concise in answers during interviews;Develop a self-contained project to talk about that is simple to communicate and offers lots of hooks into interesting questions;Prime the interviewer to ask specific questions about the project", "entry": "e352cffe-7782-4b7d-9c92-bdec5499263e", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "e3748a66-0159-4d56-a936-11366d2e16ab", "created_at": "2024-04-25T20:49:35.486457Z", "updated_at": "2024-04-25T20:56:12.294986Z", "content": "I'm thinking that my next \"dream job\" will be Octopus Energy, maybe it's easier than Monzo, unsure. They use Django, and that's a pro and a con. Will they clook at Continuum source code? Do I need to \"prepare like mad\" to refamiliarise myself with Django? I just spent ten minutes combing through the Test Driven IO courses and compiling a list to complete, you know, how I do. Then I realised that's not a practical approach. So I'm outlining what might be a more practical approach here.\n\nSo, given that I have a limited number of hours in the day, two hours project work in the morning, two hours reading in the evening, I need to ensure I'm working on the most important stuff first.\n\n - I shall continue to apply to jobs for practice, I won't do Octopus just yet.\n - I have organised my tech books in order. Code style first (because I've got some code interviews coming up, with Flow Engineering), followed by DDIA, followed by the other sytem design ones, Fundamentals of System Architecture, Seven Databases, Understanding Distributed Systems, Postgres Up and Running, The Hard Parts, Building Secure and Reliable Systems, etc. I'm unlikely to get through all these before I actually interview but it'll prep my mind. \n - In the mornings, in project time, I'll go through TestDrivenIO and do the Django courses, and I'll use that knowledge to shore up Continuum. This will actually solve two problems, it'll build Continuum to the point I can actually start to advertise it and kick off that project down the line.\n - At work, I'll focus 100% on pipelines, building my microservice, frontend, etc. Design properly, etc. I'll have two case studies to build and compare, Continuum, and Pipelines.\n\nThat will be more that enough.", "mood": null, "actions": "Apply to practice jobs for experience;Organize tech books and prioritize reading list;Complete TestDrivenIO Django courses in project time", "entry": "e352cffe-7782-4b7d-9c92-bdec5499263e", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "7115258a-b9eb-46e6-97ed-99e057e07db1", "created_at": "2024-04-29T13:59:13.913193Z", "updated_at": "2024-04-29T14:00:37.076700Z", "content": "Generally speaking, right now I am quite busy. I'm feeling the load just a little bit. I have several applications open and ongoing, and the Monzo one is by far the most important. I am keeping tabs on everything, but I am feeling a little burned out, and I know I have brought this on myself by choosing to find a new job, but this is the right thing to do, I need to get to that next level then I can relax for a while, properly relax. (Although Monzo is going to be hardwork and I also have the probation to pass.. although at that point I can make Monzo everything I do.)", "mood": 3, "actions": "Focus on completing the Monzo application;Take steps to manage feelings of burnout;Prepare for the probation period at Monzo", "entry": "1973d65d-b2e6-477f-8d42-3a21f183b779", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc", "a469ba00-f085-41ed-8085-b10ca59531b7"]}, {"id": "d857e6ae-0848-482e-8d05-8a55a4fe4f2b", "created_at": "2024-04-28T13:13:44.726848Z", "updated_at": "2024-04-28T13:14:40.556961Z", "content": "Mind is racing today, and I'm feeling a bit scattered because I've got lots of bits to do and am struggling to keep it all straight in my head. \n\nI have tweaked one of my systems, I now do my workout, meditation, Dual N Back, and Leetcode at lunchtime, fitting it all into one hour, the idea is a short sharp bang to get it out the way.", "mood": null, "actions": "Schedule workout, meditation, Dual N Back, and Leetcode during lunchtime", "entry": "d582779c-a56d-478e-9609-f306ec2b2eee", "tags": ["a469ba00-f085-41ed-8085-b10ca59531b7"]}, {"id": "0a397753-ec6b-4cfe-9dc4-0e0be5ae3d50", "created_at": "2024-04-26T10:35:24.053738Z", "updated_at": "2024-04-26T16:22:05.289081Z", "content": "Did not sleep well last night, and I'm feeling fine but just not totally with it. And a bit unmotivated. I'm constantly checking my emails to see what the outcome of the Monzo interview is...\n\nOh my god I got through to the next round!!! I have no idea how that happened. I am now on full pelt to get up to speed on code quality, Python programming style, datastructures and algorithms.", "mood": 5, "actions": "Focus on improving code quality, Python programming style, data structures, and algorithms", "entry": "20b673ca-f02a-4250-8e1a-65f0b291cb92", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "eb4c92a8-4cd3-40d4-912f-4498728d33c1", "created_at": "2024-05-06T09:15:58.436578Z", "updated_at": "2024-05-06T09:17:48.210180Z", "content": "Right, no garden this year. I did attempt it earlier this year, but everything I plant is either dieing or being eaten by slugs. I have no chard, no spinach, no rocket, nothing really. It's pissed me right off, and I'm annoyed that it's a failure. Gardening takes a lot of time, and I don't have capacity, so I'm not doing one this year. Why do I feel so bad about it, I feel deep rage, frustration, and anger at the situation. We bought this house with a greenouse so that we could do this sort of stuff. But, I literally do not have the time to relax and garden so I won't.", "mood": 1, "actions": "Reflect on feelings of rage, frustration, and anger at not having a garden this year.;Consider future plans for utilizing the greenhouse effectively.;Prioritize self-care and relaxation without the commitment of gardening this year.", "entry": "2ca286a1-c8db-4d37-baf6-0978a250761d", "tags": ["65d6837f-11a8-48a8-a69c-5da9dfeabf59"]}, {"id": "eb630395-98a6-4e44-84d8-851fd87d6942", "created_at": "2024-04-26T17:10:17.056040Z", "updated_at": "2024-04-26T17:11:40.515673Z", "content": "I am feeling a lot more positive today, partly because of the good news about Monzo. But if I take a step back and look at what is going on in my life, I've just passed my degree with a score of 4.0, I'm halfway through an application with Monzo, my app Continuum has been up and running a while, is in good shape, and I'm actively using it (and even finding it quite useful). This is further than I've ever been before with my projects. My weight is down to 89kg which is my target. Most things in my life are actually going pretty damn well.", "mood": 5, "actions": "", "entry": "20b673ca-f02a-4250-8e1a-65f0b291cb92", "tags": ["a469ba00-f085-41ed-8085-b10ca59531b7"]}, {"id": "5030bf5a-5e5f-446c-a90b-fff259462178", "created_at": "2024-04-26T10:36:06.483406Z", "updated_at": "2024-04-26T10:37:38.725153Z", "content": "Some rapid fire features I want to add to Continuum.\n - When you add the first though to a new entry, it should update in the navigator on the right.\n - Improve the quality of the todo list extraction.\n - Add the ability to filter entries by tags (only shows the entries that contain thoughts with tag).", "mood": 4, "actions": "Update first thought to new entry in navigator on the right;Improve quality of todo list extraction;Add ability to filter entries by tags", "entry": "20b673ca-f02a-4250-8e1a-65f0b291cb92", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "8a29c653-973b-44a5-b840-18d401603b56", "created_at": "2024-05-07T10:28:07.660354Z", "updated_at": "2024-05-07T10:29:12.498336Z", "content": "Just had my coding interview with Monzo and I feel that it went very positively. But I thought I had done terribly on the previous one and that ended up being successful, so clearly my calibration is off. All I can do now is focus like mad on the system design interview and hope for the best.", "mood": 5, "actions": "Focus intensely on system design interview", "entry": "9bd4a584-dbbd-4e2e-8f55-cad055c39dbd", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "fb78cf98-5d6d-4f4e-9e4d-57666c4999d3", "created_at": "2024-04-29T13:58:43.720112Z", "updated_at": "2024-04-29T13:59:14.415353Z", "content": "I have two introductory chats today, I'm not bothered about either of them, but this is for practice. Although I do need to be careful that I'm not overloading myself in the short term.", "mood": 3, "actions": "Be careful not to overload yourself in the short term", "entry": "1973d65d-b2e6-477f-8d42-3a21f183b779", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "39330921-6207-45a6-afbf-22a55729bac5", "created_at": "2024-04-29T14:00:38.070765Z", "updated_at": "2024-04-29T14:01:06.783844Z", "content": "I got the next task through from Monzo, it's to build a webcrawler in Python. I have thought about it and know how I want to approach this/solve it.", "mood": null, "actions": "Build a webcrawler in Python", "entry": "1973d65d-b2e6-477f-8d42-3a21f183b779", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "a21eeae0-6a71-4c17-96f5-cf0eaef70556", "created_at": "2024-05-07T10:29:15.997119Z", "updated_at": "2024-05-07T10:30:39.468715Z", "content": "I've started working my way through the second part of DDIA, and have completed the first chapter. It seems that Monzo are going to go into lots of details on consistency, and concurrency. I need to focus my attention there. I should focus on DDIA, and SDI2.", "mood": 4, "actions": "Focus on consistency and concurrency in DDIA;Focus on DDIA and SDI2", "entry": "9bd4a584-dbbd-4e2e-8f55-cad055c39dbd", "tags": ["8464af39-4ab6-42c4-b6c0-949546bc1b38"]}, {"id": "4c96b417-4c2c-4983-9259-83268a3224cb", "created_at": "2024-05-07T11:46:22.410452Z", "updated_at": "2024-05-07T13:04:02.741327Z", "content": "Today I added the feature that let's Sam choose between dev and prod when creating and launching simulations from the frontend.", "mood": 5, "actions": "Test the feature that allows Sam to choose between dev and prod when creating and launching simulations from the frontend.", "entry": "9bd4a584-dbbd-4e2e-8f55-cad055c39dbd", "tags": ["182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "b130e869-ce46-4758-bcac-fde557f257b7", "created_at": "2024-05-10T11:01:43.011716Z", "updated_at": "2024-05-10T11:04:17.173651Z", "content": "I had an excellent interview with Agoston from Promaton. This was for the Platform Lead role, which is.. interesting. It would be a direct jump to technical leadership, now that is technically what I want right? It would be fully remote, it would be lots of responsibility, definitely making an impact. Technically this fulfills my criteria. I would be building big systems, leading lots of people, making decisions, building my leadership skills. I'd have reasons to read lots and improve my thinking/decision making. Unsure whether I'd go for it, the thing is it's not the kind of company I had in mind. Dentistry.. hmm.\n\nThe interview itself went great, he was testing me from the get go by my answers and questions. I think I asked lots of sensible questions, and we had good discussion. I left on a good note, so we will see. They will attempt to hire internally first, and if that doesn't happen they'll reach out to me next week.", "mood": 4, "actions": "Consider the opportunity with Promaton for the Platform Lead role;Await a follow-up from Promaton next week;Do further research on Promaton to assess alignment with your ideal company vision", "entry": "731f2f59-bfab-48ee-bbb9-c0c742f84bbc", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "1f24a084-42a9-4e63-b776-00b3a0c58ff4", "created_at": "2024-05-11T08:53:42.795655Z", "updated_at": "2024-05-11T08:53:42.795670Z", "content": "", "mood": null, "actions": "", "entry": "731f2f59-bfab-48ee-bbb9-c0c742f84bbc", "tags": []}, {"id": "e791b516-8322-484d-9951-4108d543c83e", "created_at": "2024-05-14T10:16:22.442676Z", "updated_at": "2024-05-14T14:20:03.607015Z", "content": "I got invited to an online assessment for the Amazon SDE job, which I'm pleased with! So my CV and a referral does appear to be enough to get me through the door. It looks like a coding test, i.e leetcode. I've not been preparing leetcode unfortuantely, so I'm not prepared for this. Additionally I don't want to spend time doing leetcode because I'm preparing for my Monzo interview. I'll simply have to do my best, recalling what I know about the various algorithms. Okay having just said that, I am doing leetcode, I'm going to fit it into my lunchtime hour long blocks that I've called my lunchtime routine. I've found a leetcode program called Amazon 25 which seems appropriate so just working my way through that.", "mood": 4, "actions": "Prepare for Amazon SDE online assessment using Amazon 25 Leetcode program during lunchtime routines", "entry": "c4f85489-4a77-4c03-91ee-86506b539c98", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "b750c78e-72fd-4390-8bf1-713aeccadc33", "created_at": "2024-05-11T08:54:17.457955Z", "updated_at": "2024-05-11T08:54:49.551920Z", "content": "Finished off the chapter on issues in distributed systems.", "mood": null, "actions": "", "entry": "8d2d6c37-ac4b-4e98-a220-0c2882212eb2", "tags": ["8464af39-4ab6-42c4-b6c0-949546bc1b38"]}, {"id": "c64c8c02-1f65-4817-8f74-a1f91582f821", "created_at": "2024-05-11T12:44:57.166699Z", "updated_at": "2024-05-11T14:12:04.445503Z", "content": "We've been to B&Q, hopefully the only time we'll need to go. I need to make sure I don't do what I did last time and waste lots of time going back and forth to the shops. We bought tiles, adhesive, spacers, grout, etc. Should be plenty to get started. I'm going to prepare the bathroom today and maybe plaster some of the holes. Okay, as usual, there's loads of extra gotchas and edge cases. I've spent the last two hours getting things off the wall, including a bit of metal that was embedded into it. Then I sawed off the old sink pipes and capped them, which was a bit dicey with some small leaks but we're there now. Can't be bothered to plaster today, I'll do it tomorrow.", "mood": 3, "actions": "Prepare the bathroom for tiling;Plaster the holes in the bathroom wall;Decide on a time to complete plastering the holes", "entry": "8d2d6c37-ac4b-4e98-a220-0c2882212eb2", "tags": ["e6d6f67d-988e-4a9a-a9bc-19dc30bd37a5"]}, {"id": "9b26ed59-194f-457d-a8d1-556385583e51", "created_at": "2024-05-11T08:53:54.220413Z", "updated_at": "2024-05-11T12:45:58.331071Z", "content": "I had a good session sorting Evernote this morning! Starting to organise my books properly using goodreads, this solves two problems, it does all the sorting, organising, and rating, tracking for me. Why did I ever think doing it myself would be a good idea, I am using a lot of leverage and freeing my up time. Second, this will help me find and prioritise good books to read next.", "mood": 5, "actions": "Set up Goodreads for organizing books;Utilize Evernote for sorting and organizing tasks;Prioritize reading list based on Goodreads recommendations", "entry": "8d2d6c37-ac4b-4e98-a220-0c2882212eb2", "tags": ["5bd28ffb-5c2b-4720-902a-41cff9da6885"]}, {"id": "eda2cde8-1d13-4151-a823-e3e2792de1af", "created_at": "2024-05-13T18:03:50.689818Z", "updated_at": "2024-05-13T18:12:44.746082Z", "content": "I have a natural tendency to want to spend more time on my current projects at the expense of all else. Prime example, I have not been doing my lunchtime routine at all. Out of my daily keystone habits, the one I seem to be doing consistently are my daily walks which are closing my activity rings, I do tend to drink 2L of water, I do complete my Anki cards. But that's about it annoyingly. Actually I'lln unctotell you what, I've had one of those days today where I've really not been myself, I knew it before it had begun, I couldn't concentrate this morning, felt incredibly tired, and I have ended up spending most of the day just plowing through books on system design. Now at first that sounds productive but it's not, it's not done from a place of control and relaxation, it's from a place of obsession and anxiety. For example, I have been stressing about the amount I have to read to prepare for the system design interview. I've had this conversation with myself many many times, there are a finite number of hours in the day, and an even smaller number where I have the mental capacity to actually work. I have systems to deal with this, it's two hours in the morning, possibly three. And really, I need to stick to that. It's hard because I feel that if I don't make the most of this opportunity for Monzo I'll have wasted my shot, and for that reason I'm allowing myself a short elastic burst of effort to go beyond my normal routine. The problem is of course that I've been \"elastically\" bursting for maybe four or five months now! I did that to meet my goals for the MSc, and I didn't really take a break afterwards before starting to prepare for a new job. So here I am, at the end of the Monzo process, working on hard on bringing myself up to speed on system design as best as possible, but trying hard not to \"waste\" my whole week on it because it's my week off and I wanted to also relax and achieve other things (DIY). So I'm admitting that today was a bit of an uncontrolled one, where I got a bit carried away and made myself anxious with the amount I decided I needed to read, but going forwards I'll try very hard to go back to my normal routine with just an extra hour or two to boost my preparation. I'm also using my reading time to prepare as well which is concession I think it reasonable given the stakes of this job.", "mood": null, "actions": "Stick to two to three hours in the morning for system design preparation;Take a break after the Monzo process before starting a new job;Balance relaxation and productivity during the week off by not overcommitting to preparation", "entry": "5c0baa89-4641-4261-b955-cf8e89ace471", "tags": ["5bd28ffb-5c2b-4720-902a-41cff9da6885"]}, {"id": "9c3aa25e-2bea-4fff-b3b6-f359f8277209", "created_at": "2024-06-02T19:49:18.175171Z", "updated_at": "2024-06-02T19:49:18.175183Z", "content": "I had my first meeting with engineering manager today, Martine. She seemed nice. I gave a brief introduction, so did she, she started in SF and did her own start up that went through YC. She came to London and worked for Tessian, took a sabbatical and travelled for seven months, started at Monzo a month ago.", "mood": 4, "actions": "", "entry": "a8c0c3ee-f671-4751-bc32-67ca6a6b6ec9", "tags": ["f3c20520-1646-41ce-8c7d-90d433c316a2"]}, {"id": "e6e1699d-e1fa-4dcc-bf58-8b14a565d001", "created_at": "2024-05-20T06:53:23.750458Z", "updated_at": "2024-05-20T06:55:32.163802Z", "content": "It's Monday 20th and I've got my Monzo interview this morning. Annoyingly, I slept like garbage. I could not get to sleep so took a sleeping pill and I'm still feeling the effects this morning. This is, a very bad outcome, but it is what it is. Annoyingly it doesn't seem to be something I can control, either I have a great day, like yesterday, or a bad day. Today feels like it might be a bad day - I'm just unlucky. I shall do my best though. You know that feeling where you just pause and your mind just stares into the distance, pulling thoughts together is a chore, ideas don't just come to you.. that's what I'm feeling now. It's the worst possible state to be in prior to the system design interview, sods law.", "mood": 2, "actions": "Prepare for Monzo interview;Review system design concepts;Take a moment to relax and clear your mind before interview", "entry": "d0ec576f-404a-4eee-8902-0d4880a0cab5", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "3fd6cadb-ed31-496f-b03a-5e6eea144ad8", "created_at": "2024-05-13T18:13:13.287830Z", "updated_at": "2024-05-13T18:13:52.805744Z", "content": "The list of entries in the navigator has now gone off the end of the page, and as expected it's not scrolling properly. At this point I need to revisit the code and sort by the latest N number of entries.", "mood": 2, "actions": "Revisit the code for the navigator entries;Sort entries by latest N number of entries", "entry": "5c0baa89-4641-4261-b955-cf8e89ace471", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "23908d60-f9ce-4fdf-aea6-adaf9c56717b", "created_at": "2024-05-16T10:24:36.776466Z", "updated_at": "2024-05-16T10:26:06.803775Z", "content": "A thought that's been going around my head recently, which is one I've had before, is to become better at conversation by preparing topics ahead of time. The problem is that it requires effort, which I don't prioritise so I don't do it. I end up in most situations without having anything to say. I'm occasionally (but not always) able to come up with stuff on the fly. But by preparing, I would always have something to say.", "mood": null, "actions": "Work on preparing conversation topics ahead of time", "entry": "9e38ce0f-ab1c-425b-aee4-f2cd31e955da", "tags": ["c3f95de6-2b2a-4b9f-98b1-31fc7ee3ff3a"]}, {"id": "738a10fb-d399-4f7f-9ff6-ce28caba9a9f", "created_at": "2024-05-16T08:57:52.361428Z", "updated_at": "2024-05-16T09:00:01.379250Z", "content": "I have a schedule for preparing for Monzo now, after much anxiety and worry about trying to cram too much in, my final list involves finishing off the DDIA book in the mornings, coupled with a few dotted chapters from SRE and other books in the middle of the day to round out my knowledge of monitoring and security, and then papers in the evening to understand the individual technologies better. I am feeling tired today though, tired of the whole process, after Monday I do intend to slow everything back down. This is what I said would happen after my MSc but it didn't really. I need to seriously get better at just doing my morning slot and leave it at that, I always worry and feel that I should do as much as possible towards the next goal and end up burning out again and again.", "mood": 3, "actions": "Finish reading DDIA book in the mornings;Read dotted chapters from SRE and other books in the middle of the day;Read papers in the evening to understand the individual technologies better", "entry": "9e38ce0f-ab1c-425b-aee4-f2cd31e955da", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "e1864a1d-cf17-4835-b0fc-f5a35af814c1", "created_at": "2024-05-16T10:18:47.254050Z", "updated_at": "2024-05-16T10:23:37.277693Z", "content": "Create a mobile client for continuum. Finish tearing down and transferring Evernote. Plan holiday to Sway/Bournemouth. Plan Furiosa date night with Susie. Build the herb patch. Apply to the Amazon job. Put all my clothes away. Reply to Louis. Call Mum back. Organise date to go and see Lucy and Nathan. Add hot keys to Continuum, for example to create new thought. Continuum navigator needs to be paginated. Continuum AI needs to be improved. Add filtering to Continuum.", "mood": 3, "actions": "", "entry": "9e38ce0f-ab1c-425b-aee4-f2cd31e955da", "tags": ["417756a5-1f84-4ff5-9c58-53ce09a8701b"]}, {"id": "5531e862-9f9b-4432-ac75-75751e141a2d", "created_at": "2024-05-14T14:18:04.008833Z", "updated_at": "2024-05-14T14:18:34.207536Z", "content": "The data sometimes takes a very long time to load, also the UI doesn't show any loading status, so it appears as if all the data is missing.", "mood": 2, "actions": "Improve loading time of data;Add loading status to UI", "entry": "c4f85489-4a77-4c03-91ee-86506b539c98", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "fd7f1836-009c-4f53-8761-836561604523", "created_at": "2024-05-16T09:00:04.471501Z", "updated_at": "2024-05-16T09:50:31.593979Z", "content": "Ollie has had some good ideas, he's doing all the work and I need to pull my weight. We've got a rough plan, it's very similar to the pattern for my stag. Stay somewhere the weekend, skydiving and then gokarting on the saturday, then brunch on the sunday. I'm going to post the plan in the group chat. Okay skydiving looks good, they can split a bigger group into two groups back to back.", "mood": 3, "actions": "Pull my weight at work;Post the plan in the group chat;Book skydiving for the weekend", "entry": "9e38ce0f-ab1c-425b-aee4-f2cd31e955da", "tags": ["cb6a362d-4b54-489d-9d11-d98128054cc6"]}, {"id": "e7cb3a0c-27cc-4763-8f12-dfe9fb14e39b", "created_at": "2024-05-14T14:18:36.742192Z", "updated_at": "2024-05-14T14:19:06.928491Z", "content": "I've spent an hour tidying the bathroom, moving everything out, hoovering it, and wiping down the walls, basically preparing it for the priming which should come later today.", "mood": null, "actions": "Prime the bathroom walls later today", "entry": "c4f85489-4a77-4c03-91ee-86506b539c98", "tags": ["e6d6f67d-988e-4a9a-a9bc-19dc30bd37a5"]}, {"id": "b29b56e4-5899-438e-a688-4ce102899293", "created_at": "2024-05-18T16:32:13.146692Z", "updated_at": "2024-05-18T16:33:13.081067Z", "content": "I've been preparing like mad for my Monzo interview, just f**k tonnes of system design. Honestly at this point I'm just going to be glad it's over, I'm also glad I did it though, it'll be useful knowledge I know it will. I'm not thinking too much about what happens if I don't get it.", "mood": 4, "actions": "Reflect on system design preparation for Monzo interview", "entry": "d7e7de33-ccc6-4782-8275-2fe6c0671a8a", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "6d55b4b0-0bbb-4f8e-ad94-424d14e4bd51", "created_at": "2024-06-02T19:55:19.319304Z", "updated_at": "2024-06-02T19:55:19.319317Z", "content": "There are 450000 businesses with Monzo business banking. I will be in the Growth & Signups Stream who's job is to get customers through the door. It's about rapid experimentation, trying things out, working fast, doing products, partnerships, etc. The collective is called Business Banking and has 6 teams. The BB collective is like a mini startup within Monzo. They all sit together in the office. The team is a tech lead called Charles (Senior iOS), an android engineer called Kate, three backend engineers Luke, Denara, Abbey. They are hiring a web engineer. They also have a part time designer, and a data scientist called Vincent. They share two product managers pablo and Christa, although they temporarily don't have one for the team itself. They occasionally get an ops person to keep ops up to date on what kinds of challenges might be coming their way. Elanie is the VP of Business Banking. Monzo set goals every six months, Apr to Sep. So I'll start at the end of the goal phase. This current one is about new businesses. Most people come into the office on Tuesday and Wednesday, because there is free lunch. Martine and Kate are in most days. The biggest challenge in the team right now is prioritising the work, getting it done, and moving onto the next things, cannot dally.", "mood": 4, "actions": "", "entry": "a8c0c3ee-f671-4751-bc32-67ca6a6b6ec9", "tags": ["f3c20520-1646-41ce-8c7d-90d433c316a2"]}, {"id": "89bde53f-a4ee-44d0-ab4f-cdd3fdd9548c", "created_at": "2024-05-20T10:08:03.774197Z", "updated_at": "2024-05-20T10:13:36.651530Z", "content": "Well - the behavioural interview I think was okay. I don't think I did a good job on the system design. It was all about stream processing which is the stuff I didn't really focus on haha. It goes to show, I spent a LOT of time working my way through DDIA, when actually, none of that came up, at all. We didn't even touch databases. It was all about the algorithm for processing events. What does that tell me? A negative view would say that everything I did to prepare for this interview was wasted and pointless. A less negative view is that it's knowledge that I've now learned and will be useful regardless, so nothing learned is ever wasted. A more practical and insightful view would say that these interviews are very hard to prepare for and actually practicing problem solving may be more appropriate. I probably have the base knowledge, but reviewing system design interviews and doing them myself in a practice setting, including leetcode, is probably the best way to prepare. And not just prepare, but become a better problem solver generally, it's very tied up with how to think more critically and creatively. I already have a system in place for this, it's a system I've not really followed through on but maybe this is a wakeup call to nail this part of my life. Understand and build mental models. Understand and create strategies for thinking through problems. Practice problems like leetcode, and practice problems like System Design. Beyond that, I don't think much else would have helped (except for perhaps getting a good nights sleep but I'm not going to beat myself up for that.) I'm actually feeling surprisingly positive, but not because I think I've passed, I actually am mostly expecting to fail and I will be dissapointed (part of me is deparately hoping for a similar result to what I got with Sharon where I thought it had gone shit but ended up passing), but honestly I think that system design review really didn't go well. Oh well, I'll bounce back. Onto the Amazon one...", "mood": 3, "actions": "", "entry": "d0ec576f-404a-4eee-8902-0d4880a0cab5", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "e77a95f6-ad87-40ee-98a8-782650c78c65", "created_at": "2024-06-02T19:57:16.340737Z", "updated_at": "2024-06-02T20:03:20.188819Z", "content": "We were are Louis & Helens this weekend, travelled up after lunch yesterday, came back today. It's about a three hour drive, it's half term so traffic was heavy. Went to a place called Omni in Peckham, a vegan place that was great. Six courses, shared, you don't choose they just bring it to you, not pretending to be meat like vege sausage etc, but just presenting real veg in the best way possible. We need to grow and cook Lionsmane Mushroom. Next day went swimming in local lake at Beckanham, then got streetfood at the local market in the park. A lovely day out. Susie thoroughly enjoyed herself, I think it was a good amount of socialising and activity for her, we do a little every now and again. Louis and Helen have been offered jobs in Australia, potentially starting in September. They'll be in Wallagong, just south of Sydney. Helen doing senior ward management in the ward after A&E, Louis in last placement. He said he wants to be an aneasthatist. They need someone to look after their plants whilst they're away in Australia (they might be there a year or two). They're going to Glastonbury, we agreed they can park their car outside our house, we'll look after their bags. Louis gave me some purple sprouting broccoli, it gets planted in July, grows throughout the winter and is ready to harvest next year.", "mood": 4, "actions": "Grow and cook Lionsmane Mushroom;Look after Louis and Helen's plants while they are away in Australia;Plant purple sprouting broccoli in July", "entry": "50db575b-d26e-4135-9dc6-b1c7fb894318", "tags": ["395dd3d0-bdcc-46c5-823c-6f5be9fc38f1"]}, {"id": "2e00c379-3e87-4572-9a81-a2404d474db1", "created_at": "2024-05-20T13:27:13.666137Z", "updated_at": "2024-05-20T13:33:20.199552Z", "content": "Amazon one did not go that well either, to be honest I'd run out of steam. I completed the first coding exercise but did not get to the second. So, lots of thoughts going around my head, am I a failure, do I not have what it takes to get these jobs? Am I defined by getting these jobs, etc. Basically, no, my purpose is to build great tech that makes an impact, I don't NEED to be at one of these companies for that to happen. Also as I've told myself multiple times, it's a numbers game, and I can simply keep applying. In order to best prepare for these interviews, I absolutely cannot \"burst prepare\" like I did with Monzo, because that didn't actually help at all. My strategy, which I've already figured out a long time ago, is to build up a huge knowledge base in Anki (I need to deal with the deluge of extra cards I've added over the last few weeks), and practice problem solving. This is, I think, the single best way to do it. I need to be regularly consuming tech books and Ankifying the results, and staying on top of that knowledge, but it must be sustainable, with a maximum of two new cards a day as planned. The missing part is problem solving in system design, and also problem solving with programming, which is actually what tripped me up today in both applications. Amazon was directly problem solving with coding, but actually that's what Monzo wanted to dig into as well, they literally didn't seem to care about what tech I was choosing, whether it was sharded, partitioned, etc. I mentioned Kafka and they nodded, but they wanted me to communicate the design and be clear on the algorithm. Fucking algorithms.. so leetcode unfortunately seems to have become much more important? One a day? Half an hour a day? Is that reasonable? Watching of system design interviews? I really liked Hello Interview that had a good channel, good content, and a cool AI powered practice environment. Maybe I just do that. For how long? Well.. forever, or at least until further notice. This is what I mean by it's not something I should \"burst prepare\" for, it's just something I try to get better and better at over time.", "mood": 2, "actions": "Deal with the deluge of extra cards added to Anki over the last few weeks;Regularly consume tech books and Ankify the results;Watch system design interviews for practice", "entry": "d0ec576f-404a-4eee-8902-0d4880a0cab5", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "15ee6b32-d12b-4176-9e43-3a9cc6633253", "created_at": "2024-05-21T09:46:28.806061Z", "updated_at": "2024-05-21T12:56:03.333788Z", "content": "During my week off, the team saw rate limiting from ClearML. We are sending 8000 requests/s. The goal is to investigate this, and reduce the number of API calls we make. More generally, we need better integation with ClearML.", "mood": null, "actions": "Investigate rate limiting issue with ClearML;Reduce number of API calls made per second;Improve integration with ClearML", "entry": "7edfcd77-45bb-40d0-bd08-80e1aed98cf0", "tags": ["df2b6819-1138-42bb-b5bb-16defaefa511", "e2285c74-3a2f-4d46-802c-45fbe8b39bcd"]}, {"id": "02290423-f7b0-4f53-9db5-976c81dbf165", "created_at": "2024-05-21T12:56:02.213330Z", "updated_at": "2024-05-21T13:55:12.139863Z", "content": "I used mitmproxy to capture all requests out of the pipeline controller, it is an incredibly chatty application! Got about a third the way through an integration test and it's up to about 5000. I'm now doing a smaller test and analysing the actual numbers of requests made, to give myself a benchmark to improve upon. There were definitely some places in the reporting functionality that could be improved, I've reduced the rate at which it polls, also I've batched calls where appropriate.", "mood": 4, "actions": "Analyze actual numbers of requests made;Improve reporting functionality;Optimize polling rate and batch calls", "entry": "7edfcd77-45bb-40d0-bd08-80e1aed98cf0", "tags": ["df2b6819-1138-42bb-b5bb-16defaefa511", "e2285c74-3a2f-4d46-802c-45fbe8b39bcd"]}, {"id": "35353a68-5598-43c4-a65b-c79977064e95", "created_at": "2024-05-20T19:54:25.868140Z", "updated_at": "2024-05-20T19:55:17.252987Z", "content": "So I got through to the next round of Amazon. Genuinely surprised. Honestly my judgement of how well I do in interviews is completely off. That bodes well for Monzo, although it doesn't mean I did well at Monzo, it just means that I have absolutely no idea what the result will be.", "mood": 4, "actions": "Prepare for Amazon next round;Prepare for Monzo interview", "entry": "d0ec576f-404a-4eee-8902-0d4880a0cab5", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "18b9267f-4321-40be-8a96-bf61600e4d69", "created_at": "2024-06-02T19:39:29.200493Z", "updated_at": "2024-06-02T19:41:08.375655Z", "content": "We talked about accountability and keeping to goals. He has a number at the moment and I pledged to remind him of these when we spoke to keep him focussed. He said he struggles to keep to mid term level goals, he is good day to day and having long term visions but not following through on medium length goals. His top priorities are a half marathon in October (in bournemouth). Working on Centour, applying for jobs (currently as an application in progress with the Coast Guard), and also may begin a maths degree.", "mood": 3, "actions": "Remind him of his accountability goals;Support him in keeping to mid term level goals;Help him prioritize his goals", "entry": "50db575b-d26e-4135-9dc6-b1c7fb894318", "tags": ["173f2978-a01e-4136-9200-bb1c2c868c0f"]}, {"id": "8129646a-8075-4b61-81ac-c619263640c5", "created_at": "2024-05-22T17:04:10.969745Z", "updated_at": "2024-05-22T17:05:48.385179Z", "content": "I heard back from Monzo. It's a bloody offer!! Well.. almost. They said feedback in the hiring comittee was good, they're \"provisionally\" looking to move to the offer stage. The recruiter is working in the background on team allocation and specifics on offer details then they'll maybe make the offer. So until it materialises I'm not considering it complete yet, but... that's a damn good result and I'm happy. If they rejected now I wouldn't even be mad because it meant I passed the system design!", "mood": null, "actions": "Wait for Monzo's offer to materialize", "entry": "66019c42-1784-413e-8c24-fe32eebad746", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "82fdf130-cc14-41df-b33a-4982f16c51e0", "created_at": "2024-05-23T11:41:15.198080Z", "updated_at": "2024-05-23T12:28:59.999412Z", "content": "I finished the work to migrate the SDK calls in the Standard Step over to the API, I'm running another experiment now to see whether I've reduced the API calls. That work was quite involved and has introduced some risk, and some bugs that need to be addressed. Okay after running the ecxperiment, it did not actually reduce API calls at all, we went from a previous 42 QPM to 44 QPM. I did a quick experiment in the python interpretter where I create a task and then fetched a few other tasks.. it did not result in any further API calls so I had initially misunderstood that behaviour. I'm rolling those changes back to reduce risk, my next idea is to look at reducing frequency of polling. Also there might be some areas within the initial checking of tasks that we can reduce calls.", "mood": null, "actions": "", "entry": "88a9a1cb-0e83-43ae-9ed3-310768e30b2b", "tags": ["df2b6819-1138-42bb-b5bb-16defaefa511", "e2285c74-3a2f-4d46-802c-45fbe8b39bcd"]}, {"id": "57b3107f-2a75-49c3-b1b4-3257b6109052", "created_at": "2024-05-24T05:30:05.565550Z", "updated_at": "2024-05-24T05:50:41.357311Z", "content": "Well, it's official. I have the offer from Monzo. The offer is good, very good. 95K which is almost 20K higher than my current salary, plus a 70K options package which (unlike Vaarst or Ultraleap) has a serious chance of actually paying off. And yet, I feel trepidation. I think it's because it's a leap, as it always is. I know this is the right thing to do but I just want to get some thoughts down to convince myself. Firstly, the pay and financial prospects are much better at Monzo, I will be much better off in the future if I go with them, there is no way I can match this in Bristol, this will fund our future lifestyle. Second, the paternity leave is incredible, 13 weeks (not 2 like at Ultraleap) and for the plans Susie and I have it's very aligned. I can take a 3 month paid sabbatical in five years (or an unpaid one in 2 years) which aligns more with my wanting to take time off in big chunks. So, package wise, the benefits are much greater. Second, it's a London life, which is something I think I want for a while, but even better, it's remote first! So I don't HAVE to go in to the office, I can be fully remote, but I can choose to go in to the exciting, techy London office when I choose. This is the best of both worlds, I can do the things I have in my head, spend time in London, see Arnaud, go to tech meetups, build a reputation and make connections, I can go to Google (Harriet said she and a staff engineering simply.. went to google one friday, clearly Monzo is connected) and hang out, and I can network and bond with engineers from other big tech companies and really get into the scene, I can't do that still at Ultraleap. I can also see more of Lucy and Nathan, I can travel more, stay in cooler airbnbs, I like the idea of taking the train to London, it's impressive, I can see Louis more, and meet up with people. This is an exciting part of my life that I'd miss out on if I stayed in Bristol, the good news is that Bristol is still my home base so I'm not losing anything here either. Third, Monzo is an impressive badge, there is prestige around it. I can have Monzo on my CV, I can work for a place people know, I can work for an impressive unicorn tech startup, what an opportunity. This is also a potential bridge into big tech, I can go from here to Google, to OpenAI, etc if I wanted to. But really, working for Monzo would be an impressive piece of credibility and a launching point for future roles like CTO roles and engineering tech leads and managers wherever I choose. Fourth, it's an awesome place to learn. I will be learning a new language Go, new database Cassandra, new architecture style Event Based with a huge microservices platform, and I'll be learning what it's like to operate in a company serving tens of millions of users. That's not something I've done at Ultraleap or Vaarst. It will make me a much better engineer. I'll be surrounded by very capable people DIRECTLY IN MY TARGET AREA OF EXPERTISE, not surrounded by ML people at Ultraleap which I know I don't want to go into, in reality I can only learn from Guy at Ultraleap, which I have done, but at Monzo I can learn from my team more directly. The fifth and final reason, is it represents the next step in my perceived path (which to be fair I am still figuring out). I think my path is to be the best engineer I can be, to be excellent, to be a ten times engineer, to become a renowned technical leader who is great at their craft. I miss what I did at Vaarst, but at Monzo I can rise through the ranks to do that again, in a much more prestigious company. So it's definitely a step in the right direction. What are the downsides? Well, there is risk that I join and fail the probation, but that's my usual fear talking. I had this same fear at Ultraleap, and at Vaarst. They wouldn't have hired me if they didn't think I had what it takes. So it's a very small risk, and worse case it would be december when I'd have to look for another job so by being sensible financially I can create a huge buffer for safety. Another downside, what if this is a step in the wrong direction? It's a step away from ML. Maybe it's a step away from the fast paced world of startup scrabbling into a big, corporate, more bounded environment with less opportunity to get involved in all sorts of cool initiatives. No, it's not. That's a silly perspective, Monzo and other big tech companies are going to even more opportunistic for the right people, there's going to be tonnes of cool stuff to get involved in, Monzo is all about the impact and the technical skill, and the behavioural stuff, this is MORE aligned and appropriate than Ultraleap, not the other way around. I have a fear that I'll become less employable because I'll have done less recent stuff, for example at Ultraleap I can claim an incredible piece of experience, to have rebuilt the MLOps platform, also at Vaarst I had a story to tell of being the ML Engineer who shipped a product then built a team around them to lead it. That's my brand. At Monzo might I lose that brand? No, firstly, you still have that stuff that you've done, that doesn't go away. Secondly, at Monzo you have the opportunity to create that new story, a bad outcome would be if you went there and did nothing notable for three years then left and no story to tell and had to fall back on Ultraleap. The chances of that are tiny, as long as you do what you're good at and play your cards right. So you'll have achieved more at Monzo and have more to talk about than before, it will make you more well rounded. So, the negatives are not really negatives, there are so many more positives. There is one more positive as well, number six, it's a chance to reset. I wanted this chance at Vaarst which is why I was excited about joining Ultraleap and redefining who I was. This worked initially and then I let it slip, I am in a reasonable position, but could have been so much more. At Monzo, this is my chance (maybe my last chance) to do this again, to get in, to impress, to make a name for myself, to not get distracted, to focus and be excellent, and to become the person I've always known I will be.", "mood": 5, "actions": "Remember to decide on a time to go to bed every day;Make a list of priorities and goals to convince myself about accepting the job offer from Monzo;Ensure to play your cards right and achieve more to have a notable story at Monzo", "entry": "118b8f7c-31d2-48ae-96ab-7698f0b9d4dd", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "1ed46f4c-9641-46a7-85d6-2580009d418d", "created_at": "2024-05-22T17:05:50.630594Z", "updated_at": "2024-05-22T17:06:16.742035Z", "content": "More news - Palantir responded! I have a recruiter call with them, amazing.", "mood": 5, "actions": "Prepare for recruiter call with Palantir", "entry": "66019c42-1784-413e-8c24-fe32eebad746", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "423c587b-2c07-4aa3-b548-68f27a6cc604", "created_at": "2024-06-03T18:21:39.444475Z", "updated_at": "2024-06-06T12:06:26.643324Z", "content": "I felt quite exhausted today, I didn't get to sleep for a while (was thinking about lots of things). Everything just felt like an effort, and an ordeal.", "mood": 1, "actions": "Try to finalize a bedtime routine for a better sleep;Break tasks into smaller, manageable chunks to reduce feelings of burden", "entry": "22916b96-3236-4dc0-b19e-bf0a8325402e", "tags": ["02c71e7a-940b-4a98-8e89-a693a363fe66"]}, {"id": "917eb1be-a7dd-4f28-8e1c-457e9917b55e", "created_at": "2024-05-27T06:05:51.055513Z", "updated_at": "2024-05-27T06:06:42.901854Z", "content": "I'm feeling so well rested this morning, I feel great. I woke up early(ish), it's sunny, I slept well (quite likely due to P4, or even P4 + E2), I've got a day hiking with Amber and Rob, it'll be great.", "mood": 5, "actions": "Plan a hiking trip with Amber and Rob", "entry": "a57d0f4c-87f9-4692-a3fa-53febe8edfb0", "tags": ["a469ba00-f085-41ed-8085-b10ca59531b7"]}, {"id": "fea7bbc6-85be-45a8-8419-6920de833794", "created_at": "2024-06-06T12:49:41.963617Z", "updated_at": "2024-06-06T18:40:12.731165Z", "content": "I've been rethinking what Continuum really is. My current position is this (which I'm writing down so I don't forget). Everything is organised by tags (projects). I record two types of things, either updates on things I've done, tasks, what to do next etc, I have traditionally and probably unknowingly doing this as part of the thoughts themselves, but now that I've got tasks I can do it in there. Then, these thoughts are for actual, well... thoughts. Like this one, it's completely related to Continuum but it's not a thing I have to do, it's not on the todo list etc. The tag is what keeps them all together and I have the intention of creating like a project overview page that lists in a timeline the thoughts and tasks that have been accomplished. One other thing though, I've called them tasks but they're not tasks, they're threads. They're things I'm doing concurrently. So what's the best way to think about them? Should I store todo-like items in it? I think the difference is that threads are long running, over several days. For example, organising a hike with Rob and Amber. Is that a todo? Yes but it's not something that can be done and completed in one sitting and \"cleared\" from my mind. So perhaps everything is a thread in that sense.", "mood": null, "actions": "Consider storing todo-like items as threads in Continuum", "entry": "4427e9b9-e8e6-42e2-9d51-e91ef4b68027", "tags": ["74acb991-7626-4d49-ba50-8fa748a94b73"]}, {"id": "4167ab6e-7523-464d-b604-88d252d324f2", "created_at": "2024-06-07T21:12:31.145966Z", "updated_at": "2024-06-07T21:26:51.001592Z", "content": "We’re at sway this evening, drove down after work. We’re here for the week. I plan to spend it reading, walking, and relaxing. Brain is a little tired, the last week I’ve not been very healthy, lots of drinking and sleeping pills in the evening. I’m feeling it now, I feel sluggish. I need to take this week to recover.", "mood": 3, "actions": "Plan to spend the week reading, walking, and relaxing;Take the week to recover", "entry": "6a381a5a-ef7b-4b53-a9be-5f998900c83e", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "bac33812-57b1-4ce5-971c-68600499b6dc", "created_at": "2024-06-06T18:40:29.170367Z", "updated_at": "2024-06-06T18:44:13.826265Z", "content": "I did not do my Amazon assessment center today. I had no email telling me when the assessments would be, which I’d assumed was because the recruiter had forgotten. Sure enough at half ten I got an email from Paige and two missed calls, we spoke on the phone and I explained that I was going to withdraw because I’d already got an offer. I was relieved, I was so not in the mood for assessment centers today.  I feel a little bad because I didn’t follow through, also Massimo put in effort to get the referral. I hope I haven’t damaged a relationship with him. But I’ve got Monzo now, and I’m having a bit of a break week where I just cut loose and do nothing, because I’ve worked hard for months and am exhausted.", "mood": 3, "actions": "Follow up with Massimo to explain the situation and thank him for the referral;Take a well-deserved break week to rest and recharge;Set boundaries with work to avoid burnout in the future", "entry": "4427e9b9-e8e6-42e2-9d51-e91ef4b68027", "tags": ["a462be94-3a40-4082-a30d-5e126b9e6edc"]}, {"id": "a70dd24a-00ae-446d-8541-3e33607725e2", "created_at": "2024-06-11T18:12:09.642694Z", "updated_at": "2024-06-11T18:17:29.757211Z", "content": "Okay in addition to the above, I've been having throughts about how to make parallel execution simpler. I've been round loads of ideas, most really complex, it's a fucking hard problem. But I just stumbled upon a potentially very simple idea, it builds a bit on the store idea but it's orthogonal to it. So firstly, we massively simplify pipelines. If we implement the store idea above, then pipelines is freed from having to copy config around, it only ever copies parent task UUIDs across. This makes the pipeline much easier to reason about, and the config is much more explicit. So I liked that idea, but the problem was that to do parallel properly, the pipeline needs to know about what to parallalise over, and so I want coming up with all sorts of complicated ways to implement this, map reduce etc. But actually how about this, to make a task parallel you simply give it a count key with a value, like count: 10 which says create ten copies of that task. As simple as that, very easy mental model. They're all identical to each other, receive all the same config, have the same parents etc. So how do we meaningfully split up the work in this model? You leave it up to the task designer, all you need to do is make sure you tell them what number they are from 1 to 10, which is something the pipeline knows and can inject, perhaps as a config option.", "mood": null, "actions": "Simplify pipeline implementation by using the 'count' key to create parallel tasks with identical configuration;Inform task designers to number their tasks from 1 to N for meaningful work distribution", "entry": "2add0ca4-c3d3-4349-811a-d01e3cfbc01b", "tags": ["182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "2957765b-ed9e-475d-aad3-e692ecee0000", "created_at": "2024-06-08T06:25:58.822450Z", "updated_at": "2024-06-08T06:29:02.773464Z", "content": "Streaming Systems is a complicated beast, it’s like DDIA in the sense that it’s full of complex concepts and it’s a tough read, but it’s completely foundational. It’s perfect for Monzo first principles thinking so absolutely worth reading but I think I’ll have to set expectations on progress, I’m unlikely to finish this any time soon! In fact I’m going to read the first two chapters again.", "mood": 3, "actions": "Set expectations on progress for reading Streaming Systems;Reread the first two chapters of Streaming Systems", "entry": "64e0a2c2-aa47-42be-a3d4-710b81eb1d6a", "tags": ["f3c20520-1646-41ce-8c7d-90d433c316a2"]}, {"id": "2a12f791-450f-40d7-85a1-fed3bc18c8c5", "created_at": "2024-06-07T21:14:01.389409Z", "updated_at": "2024-06-07T21:19:11.843486Z", "content": "Tidying up bits and pieces today. I’ve churned through a lot, fixing bits on Specifics, pipelines, datasets, and more. I left early because I’d run out of steam.", "mood": 4, "actions": "Tidy up Specifics, pipelines, and datasets;Rest and recharge for more energy", "entry": "6a381a5a-ef7b-4b53-a9be-5f998900c83e", "tags": ["58e77cb4-eb8b-4678-96c7-30d9737fb8c4", "182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "f1ec3fb5-492d-4c10-9e21-9756dabb0f6b", "created_at": "2024-06-08T20:01:44.630109Z", "updated_at": "2024-06-08T20:14:07.474119Z", "content": "First day at Sway has been good, I did a decent amount of reading which is good, that's what I wanted to do. I also managed an early morning walk, that's important otherwise I won't get them done. I'm aiming for one a day. The rest of the day has been fairly chilled, I helped Julia out with preparing for the Sway Open Gardens which is tomorrow, the whole day tomorrow will be helping out with that (at least from 11am, I'll do my walk in the morning again). I spent a bit of time faffing with Continuum, creating a mobile application. Forgot how painful building mobile apps can be, nothing plays together. I'm using Threads to capture that work and progress. I'm liking threads, that approach seems like it's working. I feel a little bit of achievement anxiety today, actually order anxiety as well, I've felt a bit muddled. Possibly coming off the back of several days of unhealthy drinking and sleeping. On that note, I've been very healthy today, I've eaten less, (although I am going to cave and have some toast in a minute), but my calories are way down, I didn't have any beers I got Trip cans instead. I'm aiming for 80kgs now, hopefully I've blown straight past 85, which is awesome if I have because I was 89 a few weeks ago. THe key will be to keep the calories down, and stick to my small breakfasts and lunches. As for the anxiety stuff, it's hard. Whats on my mind is that I have about 2.5 months to Monzo, when Monzo starts I know it will be busy, so I want to a) get some relaxation in now and enjoy the next few months, but b) I also want to prepare effectively and hit the ground running, and c) I don't want to relax for a few months and then get taken by surprise. So my plan has been to get into a solid routine now, early morning work periods, late night reading sessions, meditation at lunchtime, and practice my systems to get them under control. Systems like writing this journal write now. The anxiety comes from not feeling like I'm doing any of that. But actually, now I reflect on it, it's not true, I am doing it, just not as much or thoroughly as I want to be, but I'll build that up. I think the chaos anxiety I'm feeling is because I've been changing my systems, I feel a bit flustered at having to relearn them. I have 2.5 months to really nail my habits. All of that is true but also this is just low level anxiety caused by less good sleep than usual, so I need to sleep more, and rest, and meditate, and just relax a bit, and everything will be fine.", "mood": null, "actions": "Remember to help out with Sway Open Gardens preparation tomorrow;Decide on a solid routine for early morning work, late night reading, and meditation at lunchtime;Increase focus on building and sticking to new habits in preparation for upcoming busy period at Monzo", "entry": "64e0a2c2-aa47-42be-a3d4-710b81eb1d6a", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "b7560303-cef4-4f73-a61a-53b71949cc69", "created_at": "2024-06-09T09:00:50.015691Z", "updated_at": "2024-06-09T18:05:32.032359Z", "content": "Nice walk this morning in the new forest, very sunny, was walking around just soaking everything in. I've done my exercise now, I've had my morning deep work, now I can relax and focus on helping out with Sway open gardens for the rest of the day. I slept well and am feeling much more relaxed and at peace today.", "mood": 5, "actions": "Help out with Sway open gardens for the rest of the day", "entry": "5534e830-3d10-441b-afba-db3f254921ff", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "b9404e8e-78b2-46bb-b6b7-f6707c5d1773", "created_at": "2024-06-10T06:59:11.119787Z", "updated_at": "2024-06-10T10:14:39.971242Z", "content": "I woke up feeling exhausted today! And serious brain fog. Weird how that sometimes happens. I've been doing my Go study, and it's going well, but god it's a slog this morning. Feeling bleurgh, unmotivated, and bored. But I have lots to do, or at least lots I want to do. I don't want to end the day with nothing complete, I at least want to forge through this lack of motivation. It's interesting actually, because I normally get side tracked by doing things that motivate me, but actually maybe this is an opportunity to do the things that I know NEED to be done.", "mood": 2, "actions": "Forge through lack of motivation and complete tasks", "entry": "9045e101-8f92-4fba-a937-c5312090a732", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "94807d51-f077-4e99-ba5b-d576c70d2765", "created_at": "2024-06-09T18:05:33.269664Z", "updated_at": "2024-06-09T18:06:55.057629Z", "content": "It was a good day, mostly spent just sitting in a chair in front of the house chatting with Jonathan and checking people's tickets. It was long but didn't seem to drag. I'm tired now, and have spent the last hour and half relaxing in the bath reading more of Sapiens. Just planning a catchup with Alex although dinner here has fallen at a difficult time. I'm feeling shattered actually, possibly a bit of sunstroke, I was sitting in the sun most of the day.", "mood": 3, "actions": "Plan a catchup with Alex;Consider taking precautions against sunstroke", "entry": "5534e830-3d10-441b-afba-db3f254921ff", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "2bd6b129-2068-4ea1-9d80-1579fdc39c0f", "created_at": "2024-06-11T18:11:12.770124Z", "updated_at": "2024-06-11T18:12:10.728899Z", "content": "Tasks are nodes, edges in the graph relate nodes. \n\nEdges can be anything that relate nodes. \n\nCloning maintains links between tasks but produces a lineage graph not an execution graph. Works well for pipelines owning children. \n\nCan imagine a parser of the config that resolved references to tasks that let people put tasks IDs in the config indicating the value for this thing should come from the output from another thing. This is how generics works, it would let you look up a task for a config key, then select the output etc. our UI makes this much more difficult. \n\nWe don’t do this however, we specify everything exactly, the exact model, the exact dataset, etc. This approach is actually very easy to reason about for  single task, all the values a specified are exactly what you’re going to use.\n\nIf we wanted to adopt the resolving approach, it would enable a much closer workflow to generics, it would even check the resolved tasks and if it was running it would wait until it was complete or failed (then maybe it would fail). Lots of issues with approach though, lots of tasks would sit taking up machine time. \n\nThe core problem that is being solved is that you can define a config for a task and launch it, before you know what the actual files are. \n\nUsability Problems\nTo use another task as input, it must have produced the outputs you need already, or be designed to produce those outputs. \n\nIdeas:\nSmall improvement by removing the concept of parallel tasks. Expand inline.\nSimple improvement by removing concept of source task. It’s just a standard task that has already finished. \nSimple improvement, add a dedicated function to save outputs that wraps the artifacts stuff. Even better, hook into ClearML and monkey patch to add whenever users create.\n\nWe could…Have a library that uploads anything written to disk to s3 and another library that allows you to “lookup” files from any task by simply searching S3. Let’s compare this to our current way, our current way saves via clearML api, because downstream has no knowledge of ids, you must materialise that as outputs which pipeline controller passes along.", "mood": null, "actions": "Consider removing the concept of parallel tasks and expand inline;Remove the concept of source task and treat it as a standard task that has already finished;Develop a dedicated function to save outputs, potentially integrating with ClearML for easier access", "entry": "2add0ca4-c3d3-4349-811a-d01e3cfbc01b", "tags": ["182ab9a7-a9af-4c02-aa04-0750a4ef3b9c"]}, {"id": "fe2ef2bb-f079-438d-9b7e-629f42a189f1", "created_at": "2024-06-11T20:54:18.737069Z", "updated_at": "2024-06-11T20:59:02.081113Z", "content": "A productive day today, started with getting frustrated at basil who wanted to be let out early. I had a fairly productive day at work, working on a solution to update the gitlab token in the container whenever the image runs. We went for lunch at the deli in sway, it was sunny, quite busy, a little basic and food took a while to come, but the food was good, I had a sourdough trout and cream cheese sandwich, it was delicious actually. I’m going to go back tomorrow because the others will be at ikea. I got some beers from the local shop, and went for a long walk out in the forest, I did a lot of thinking about Owen’s Issue and made some breakthroughs. This is a good way of doing it actually. Fish pie for dinner, I have eaten under target today which is good, have had toast in the evening, I just can’t help it I love toast so much.", "mood": 4, "actions": "Update gitlab token in container;Go back to deli in Sway tomorrow;Think more about Owen's Issue and make breakthroughs", "entry": "2add0ca4-c3d3-4349-811a-d01e3cfbc01b", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "db33d675-cf9d-46b5-a72a-c76e229315f1", "created_at": "2024-06-10T22:32:41.428285Z", "updated_at": "2024-06-10T22:35:38.416311Z", "content": "A tedious day, felt mostly disengaged. Struggled to motivate myself and have a bit of anxiety over having lots of things in the air. It would have been most effective to pick a few things and just work solidly at them, ideally the most important things. Instead I dabbled and flitted between tasks. It’s hard though because I didn’t feel drawn to anything in particular. I did a fair bit towards the new rewrite of Continuum, and I made a start on Centour. Then.. we went Alpaca walking on a nearby farm which was great fun, got lots of great photos and had a good time. After that we all went for Italian for dinner so it was a lively and lovely evening actually.", "mood": 3, "actions": "Pick the most important tasks and work solidly on them;Set specific goals for Continuum rewrite and Centour project;Plan a routine to maintain motivation and focus on key tasks", "entry": "9045e101-8f92-4fba-a937-c5312090a732", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "f3925b71-d5df-4f58-98ff-c750370a1c23", "created_at": "2024-06-11T20:59:05.049590Z", "updated_at": "2024-06-11T21:01:06.839496Z", "content": "I still some achievement anxiety, and it is definitely just that, because it’s a full unease. It’s because I feel I have to make the absolute most of the next two months. And I will, and I am, but it’s hard to shake the feeling it’s not being used to its full potential. This diary might help actually, by recording fairly precisely exactly what I get up to.", "mood": 3, "actions": "Start using a diary to record daily activities.", "entry": "2add0ca4-c3d3-4349-811a-d01e3cfbc01b", "tags": ["8e0acbb0-1c6e-4ea5-a6ce-f8dac7d80c5e"]}, {"id": "d0c30785-6fd0-4775-b6af-85754d5e2e12", "created_at": "2024-06-12T18:20:16.953643Z", "updated_at": "2024-06-12T18:22:08.529681Z", "content": "", "mood": null, "actions": "", "entry": "f563ac9c-6f8a-4f70-a149-9a22a9381ec9", "tags": ["2686833f-971d-41bb-b2af-5255e33ed3e2", "0670d269-3aff-4406-b478-dc77d09d480f"]}, {"id": "2da888ed-cae5-4a4f-aee8-9ebcdc1a0bc9", "created_at": "2024-06-10T07:00:03.349077Z", "updated_at": "2024-06-10T07:02:12.612912Z", "content": "Caught up with Alex briefly (yesterday, just forgot to make a note). He's just got back from a wedding in Cumbria. We've arranged to meet Wednesday and also I said I'd have a basic working prototype for Centour ready by then. I have a strong feeling he's reluctant to reach out to too many people without something to show. This is the problem we had with CareCrow, but it's fine, this prototype will be trivial to implement and will give us something to work with. I'm going to do it with Django and HTMX. Django as the full backend, which will make it easier to switch when we move to an app, and HTMX because we're serving static web pages to start with and HTMX adds a sprinkle of JavaScript over the top.", "mood": 4, "actions": "Have a basic working prototype for Centour ready by Wednesday;Implement prototype using Django and HTMX;Consider transition to app in the future", "entry": "9045e101-8f92-4fba-a937-c5312090a732", "tags": ["173f2978-a01e-4136-9200-bb1c2c868c0f", "2686833f-971d-41bb-b2af-5255e33ed3e2"]}]